#include "stdafx.h"
#include <windows.h>
#include <iostream>

void title()
{
	system("cls");
	puts("###  # #  ###  ###  ###  #   #  ###  ###  #  #  ###  ###");
	puts("#    # #  # #  #    # #  ## ##  # #  # #  # #   #     # ");
	puts("###  # #  ###  ###  ###  # # #  ###  ###  ##    ###   # ");
	puts("  #  # #  #    #    ##   #   #  # #  ##   # #   #     # ");
	puts("###  ###  #    ###  # #  #   #  # #  # #  #  #  ###   # ");
	puts(" ");
	puts("#####");
	puts("    #################################");
	puts("     #|   |   |   |   |   |   |   |#");
	puts("     #|___|___|___|___|___|___|___#");
	puts("      #   |   |   |   |   |   |  #");
	puts("      #___|___|___|___|___|___|_#");
	puts("       #  |   |   |   |   |   |#");
	puts("       ########################");
	puts("       #");
	puts("       #");
	puts("       ########################");
	puts("        ###                ###");
	puts("         #                  #");
	Sleep(1500);
	return;
}

void menu()
{
		puts("\n");
		puts("Меню:");
		puts("\t1. Покупка");
		puts("\t2. Просмотреть товары");
		puts("\t3. Просмотреть историю покупок");
		puts("\t4. Справка");
		puts("\t5. Выход");
}

void about()
{
	puts("\nПрограмма для работы с кассовым аппаратом супермаркета.\nУчет купленных товаров.\nРазработал Карпик Максим.");
}